alplabai/gd32-bridge-firmware/hal/gd32/pwm.c
	/* Hardware read-back: convert the live CAR/CHxCV ticks to ns at
     * the fixed 1 us tick.  This reports what the pad is actually
     * doing -- including the shared-period reality (one ARR per
     * timer: a PWM_SET on a sibling channel moves this channel's
     * reported period too) and the boot default (65.536 ms period,
     * 0 duty) before the first PWM_SET.  CHxCV can legitimately read
     * ARR + 1 (a pre-#129 single-pulse programmed compare past the
     * period); clamp so duty never reports > period.
     *
     * The tick->ns conversion mirrors bridge_hw_pwm_set's alignment
     * math: edge-aligned period is CAR+1 ticks, center-aligned is
     * 2*CAR ticks (and duty 2*CV), so a channel configured
     * center-aligned reads back the same period/duty it was
     * commanded. */
	const uint32_t car = TIMER_CAR(ch->periph) & PWM_TIMER_ARR_MAX;
	uint32_t       cv  = timer_channel_capture_value_register_read(ch->periph, ch->channel);
	if (cv > car + 1u) cv = car + 1u;
	if (pwm_one_shot[channel]) {
		/* One-shot channels sit in PWM1, where CHxCV is the INACTIVE
         * lead-in and the active width is CAR - CHxCV + 1 (#129).
         * Reading CHxCV as high-time here would report a 1 us pulse for
         * every one-shot regardless of what was commanded.  One-shots are
         * always edge-aligned -- bridge_hw_pwm_single_pulse refuses a
         * center-aligned timer outright -- so there is no center variant
         * to handle. */
		*period_ns = (car + 1u) * PWM_TIMER_TICK_NS;
		*duty_ns   = (car - cv + 1u) * PWM_TIMER_TICK_NS;
		return BRIDGE_HW_OK;
	}
	if (pwm_align_mode[pwm_timer_index(ch->periph)] == 0u) {
		*period_ns = (car + 1u) * PWM_TIMER_TICK_NS;
		*duty_ns   = cv * PWM_TIMER_TICK_NS;
	} else {
		*period_ns = 2u * car * PWM_TIMER_TICK_NS;
		*duty_ns   = 2u * cv * PWM_TIMER_TICK_NS;
		if (*duty_ns > *period_ns) *duty_ns = *period_ns;
	}
	return BRIDGE_HW_OK;
}

int bridge_hw_pwm_configure(uint8_t  channel,
                            uint8_t  align_mode,
                            uint32_t dead_time_ns,
                            uint8_t  break_cfg)
{
	if (channel >= PWM_CHANNEL_COUNT) return BRIDGE_HW_ERR_RANGE;

	/* align_mode 0..3 map to CTL0.CAM (0 edge, 1 center-up, 2
	 * center-down, 3 center-both -- alp_pwm_align_t).  Reject out of
	 * range before touching hardware so a bad value leaves the timer
	 * untouched. */
	if (align_mode > 3u) return BRIDGE_HW_ERR_INVAL;

	/* dead_time_ns and break_cfg are advanced-timer features the GD32
	 * TIMER0/7 silicon HAS, but that the V2N E1M routing does not
	 * physically expose, so honouring them would be an unverifiable
	 * register write (exactly the "cache echo verified PWM while the
	 * pads were idle" trap this file warns about above):
	 *   - Dead-time is the guard gap between a channel's main (CHx) and
	 *     complementary (CHxN) outputs, but only the CHxN pad sits on
	 *     the E1M PWM connector (see the channel-map comment) -- there
	 *     is no complementary PAIR on the wire for a dead-time to act
	 *     on, so any DTCFG value is physically inert.
	 *   - The break input needs a BRK pad, and the V2N gd32-io-mcu-map
	 *     routes none -- the break logic could be armed but nothing
	 *     could ever trigger it.
	 * Both therefore return NOSUPPORT on this board (a hardware-routing
	 * limit, not an unimplemented feature); a future carrier that
	 * routes the complementary pair / a BRK pad would lift this.
	 * align_mode == 0 with both zero is still the idempotent
	 * "set-to-defaults" call and succeeds. */
	if (dead_time_ns != 0u) return BRIDGE_HW_ERR_NOTIMPL;
	if (break_cfg != 0u) return BRIDGE_HW_ERR_NOTIMPL;

	const gd32_pwm_ch_t *ch  = &pwm_channels[channel];
	const uint8_t        idx = pwm_timer_index(ch->periph);
	if (pwm_align_mode[idx] == align_mode) return BRIDGE_HW_OK; /* no change */

	/* CAM is a shared timer-wide field and the GD32 (like most STM32-
	 * lineage advanced timers) latches it only while the counter is
	 * stopped, so bracket the change in disable/enable.  This briefly
	 * halts every channel on the timer -- acceptable at config time,
	 * and last-write-wins across the sibling channels is the documented
	 * contract.  The counter value + ARR/compare survive the toggle, so
	 * a running duty resumes with the new alignment on the next
	 * update.
	 *
	 * PRESERVE the run state: a prior bridge_hw_pwm_single_pulse on a
	 * sibling channel leaves the timer HALTED (hardware clears CEN at
	 * the one-shot's update event) with SP=SINGLE and a pulse-shaped
	 * ARR/compare still latched.  Unconditionally re-enabling here would
	 * re-arm that one-shot and fire a SECOND, uncommanded pulse on the
	 * sibling pad -- an actuation with no host command.  So only
	 * re-enable if the timer was actually running when we entered. */
	static const uint32_t cam_map[4] = {
		TIMER_COUNTER_EDGE,        /* 0: edge          */
		TIMER_COUNTER_CENTER_UP,   /* 1: center-up     */
		TIMER_COUNTER_CENTER_DOWN, /* 2: center-down   */
		TIMER_COUNTER_CENTER_BOTH, /* 3: center-both   */
	};
	/* #134: this whole block is one critical section, and the shadow is
     * published INSIDE it.
     *
     * The read-modify-write below touches the WHOLE of TIMER_CTL0 to edit
     * one field, and CEN (bit 0) and SPM (bit 3) live in that same
     * register -- written by bridge_hw_pwm_set and
     * bridge_hw_pwm_single_pulse, which reach this timer from the OTHER
     * transport's ISR.  Unprotected, this happened: I2C0_EV (priority 2)
     * snapshots `ctl0` with CEN = 0 and SPM = 0; the SPI CS-EXTI handler
     * (priority 1) pre-empts and runs a single-pulse, setting SPM and
     * CEN; this side resumes and writes its stale word back, clearing
     * BOTH -- the one-shot never fires and its caller was told
     * BRIDGE_HW_OK.
     *
     * Publishing pwm_align_mode[] inside the section closes the second
     * half: it used to be written AFTER the hardware it describes, so a
     * pre-empting single_pulse could read a shadow saying "edge-aligned"
     * off a timer already switched to center-aligned and pass a guard it
     * should have failed.  Inside the section a pre-empting caller sees
     * either the old alignment consistently or the new one, never a
     * disagreement.
     *
     * The section covers a disable, one RMW, an enable and a store --
     * short enough for the CS-EXTI handler's deadline (bridge_critical.h).
     *
     * RESIDUAL, deliberately not fixed here: the REVERSE direction is
     * still open.  If bridge_hw_pwm_configure is the one reached from
     * CS-EXTI (priority 1) and bridge_hw_pwm_single_pulse from I2C0_EV
     * (priority 2), configure pre-empts single_pulse mid-sequence --
     * between its SPM write and its timer_enable -- and single_pulse then
     * resumes and enables a one-shot whose alignment guard was checked
     * against the alignment configure has since changed.  Closing that
     * needs single_pulse's own register sequence to become a section too,
     * which lands squarely in open PR #82's rewrite of that function.
     * Tracked under #19. */
	const uint32_t sect        = bridge_irq_lock();
	const bool     was_running = (TIMER_CTL0(ch->periph) & (uint32_t)TIMER_CTL0_CEN) != 0u;
	timer_disable(ch->periph);
	uint32_t ctl0 = TIMER_CTL0(ch->periph);
	ctl0 &= ~(uint32_t)TIMER_CTL0_CAM;
	ctl0 |= cam_map[align_mode];
	TIMER_CTL0(ch->periph) = ctl0;
	if (was_running) timer_enable(ch->periph);
	pwm_align_mode[idx] = align_mode;
	bridge_irq_unlock(sect);
	return BRIDGE_HW_OK;
}

int bridge_hw_pwm_single_pulse(uint8_t channel, uint32_t pulse_ns)
{
	if (channel >= PWM_CHANNEL_COUNT) return BRIDGE_HW_ERR_RANGE;

	const gd32_pwm_ch_t *ch = &pwm_channels[channel];

