alplabai/gd32-bridge-firmware/hal/gd32/pwm.c
	/* One-pulse mode is edge-aligned only.  The ARR math below assumes
	 * an up-counter (period == ARR+1 ticks); on a center-aligned timer
	 * (bridge_hw_pwm_configure) the counter runs 0->ARR->0 with an
	 * update event at BOTH crest and trough, so OPM would halt at the
	 * wrong point and the emitted pulse width would be neither
	 * `pulse_us` nor even deterministic (and the output can freeze
	 * HIGH at the halt).  Refuse rather than fire a wrong-width pulse;
	 * the host must set align_mode back to edge (0) first. */
	if (pwm_align_mode[pwm_timer_index(ch->periph)] != 0u) return BRIDGE_HW_ERR_NOTIMPL;

	const uint32_t pulse_us = pulse_ns / PWM_TIMER_TICK_NS;
	if (pulse_us == 0u) return BRIDGE_HW_ERR_RANGE;
	/* ARR is the FULL one-shot window (lead-in + pulse) and it is a
     * 16-bit register, so pulse_us itself must fit: the widest one-shot
     * this timer can emit is PWM_TIMER_ARR_MAX us.  The old code clamped
     * silently to PWM_TIMER_ARR_MAX + 1 and still answered STATUS_OK --
     * success for a pulse it did not emit (#16).  Refuse instead: a
     * caller asking for 70 ms needs to be told, not to find out on a
     * scope. */
	if (pulse_us > PWM_TIMER_ARR_MAX) return BRIDGE_HW_ERR_RANGE;

	/* The preload transfer below requires a forced UPG.  While this timer
	 * is a live TRGO0 sync master, that UPG would be an unrequested slave
	 * trigger; hold the state lock through the event so an overlapping
	 * TIMER_SYNC cannot create that route halfway through this sequence. */
	const uint32_t sync_guard = bridge_irq_lock();
	if (!timer_sync_forced_update_allowed(pwm_timer_index(ch->periph))) {
		bridge_irq_unlock(sync_guard);
		return BRIDGE_HW_ERR_BUSY;
	}

	/* Halt the counter before reprogramming.  A prior one-shot already
     * left CEN clear, but a running continuous PWM has not, and
     * rewriting OCxM/ARR/CHxCV underneath a live counter can emit a runt
     * edge on the pad on the way into the one-shot. */
	timer_disable(ch->periph);

	/* PWM1 -- inactive while CNT < CHxCV -- is what makes this a PULSE
     * rather than a latch (#129); see the PWM_ONE_SHOT_DELAY_TICKS
     * comment above for the full argument.  Order is load-bearing: mode
     * and values are programmed while the counter is stopped, the
     * preload is transferred, SPM is armed, and only then is the counter
     * released. */
	timer_channel_output_mode_config(ch->periph, ch->channel, TIMER_OC_MODE_PWM1);
	timer_counter_value_config(ch->periph, 0u);
	timer_autoreload_value_config(ch->periph, pulse_us);
	timer_channel_output_pulse_value_config(ch->periph, ch->channel, PWM_ONE_SHOT_DELAY_TICKS);
	pwm_one_shot[channel] = true;

	/* CHxCOMSEN + ARSE are enabled for every channel/timer
	 * (pwm_channel_init / pwm_timer_init, #43) so the two writes above
	 * land in the preload register only -- the counter still compares
	 * against whatever was active before this call until an update
	 * event transfers them (User Manual Rev1.2 p.575-576, Fig 23-5 /
	 * 23-7).  Single-pulse mode's OWN "next update event" is the one
	 * that halts CEN at the END of the pulse (p.617-618), so without
	 * forcing one here the pulse would fire using the STALE values left
	 * by whatever ran on this timer before it, not the ones just
	 * written.  Force the transfer now, before arming -- it also
	 * re-seats CNT to 0, idempotent with the reset above.
	 *
	 * This is what makes the #129 PWM1 rewrite above WORK on this
	 * branch: on the pre-merge dev the compare/auto-reload preload was
	 * disabled, so those writes were immediate and needed no UPG.  The
	 * preload this branch enables is exactly why the UPG is mandatory
	 * now -- the two changes are not independent. */
	/* #89: on a sync-master timer this also fires TRGO0, glitching a slave synced off it. */
	timer_event_software_generate(ch->periph, TIMER_EVENT_SRC_UPG);
	/* This promotion is synchronous with the forced UPG above -- tell
	 * pwm_capture.c's shadow mirror directly instead of leaving it to
	 * infer promotion from TIMER_FLAG_UP (#82 review round 2).
	 *
	 * The mirrored CAR is `pulse_us`, NOT `pulse_us - 1`: the #129
	 * rewrite changed ARR from `pulse_us - 1` (PWM0, compare past the
	 * period) to `pulse_us` (PWM1, lead-in + pulse).  Mirroring the old
	 * value here would leave pwm_capture.c's shadow one tick short of
	 * the live auto-reload after every one-shot. */
	pwm_car_shadow_commit(ch->periph, pulse_us);
	/* SPM is timer-wide (TIMERx_CTL0.SPM), not per-channel, so this also
     * arms every sibling channel on this timer for the same one-shot
     * halt -- a running sibling gets silently re-perioded and stopped.
     * Pre-existing, out of scope here; tracked as #87. */
	timer_single_pulse_mode_config(ch->periph, TIMER_SP_MODE_SINGLE);
	timer_enable(ch->periph);
	bridge_irq_unlock(sync_guard);

	/* A follow-up bridge_hw_pwm_get reports the PULSE width, not the
     * lead-in: it inverts its duty arithmetic while pwm_one_shot[] is set
     * for the channel. */
	return BRIDGE_HW_OK;
}
